{
    "Header.Item1": "About me",
    "Header.Item2": "Experience",
    "Header.Item3": "Projects",
    "Header.Item4": "Contact",
    "Header.cvBtn": "Resume",
    "Header.cvName": "Mohammad-Zarak.Shah-ji-Resume.pdf",
    "Banner.Pretitle": "Hello! My name is",
    "Banner.Description": " Passionate about leveraging technology to drive <span class='underline'>innovation</span>, I am a versatile and dynamic professional with a strong software development and data analysis background. I have expertise in programming languages, web development, cloud computing, and machine learning. Let's connect and explore how we can make a <span class='underline'>meaningful impact together.</span>",
    "Banner.ActionBtn": "Get in touch",
    "AboutMe.Title": "About me",
    "AboutMe.Paragraphs": [
        " <span class='underline'>  Growth-Oriented | Collaborative Leader </span> ",
        "I am a Senior Data Analyst with a strong interest in reinforcement learning and recommendation systems. I stay updated with the latest advancements in these areas and consistently strive to apply innovative techniques to my work.",
        "From enhancing data systems to optimizing performance, I deliver data-driven insights that make a significant impact. My collaborative nature and leadership skills enable me to drive success within diverse teams.",
        "With a proven track record of mentoring and inspiring others, I tackle challenges head-on, bringing fresh perspectives and innovative solutions to every project. I am eager to contribute to a forward-thinking team.",
        "Tech Stack:"
    ],
    "Experience.Title": "Experience",
    "Experience.Jobs": [
        {
            "Tab": "BMW FS",
            "Title": " Senior Data Analyst ",
            "Date": "Sept 2024 - Present",
            "Description": [
                "Spearheaded the migration of over 750 financial reports from Crystal to Tableau, resulting in a quarterly savings of $300,000",
                "Optimized the monthly financial reconciliation process by implementing advanced SQL queries and automated data validation checks, reducing discrepancies by 25% and saving over 50 hours of manual review per month.",
                "Led a cross-functional team to integrate new financial software, enhancing data accuracy and reporting capabilities, which resulted in a 15% increase in the speed of financial closing processes and improved decision-making for senior management",
                "Developed Python scripts to automate the generation of tax letters, leading to a significant reduction in manual effort and improved efficiency by dynamically fetching vehicle data, populating templates, and incorporating user inputs"
            ]
        },
        
        {
            "Tab": " BMW FS",
            "Title": "Data Analyst",
            "Date": "Sept 2023 - Aug 24",
            "Description": [
                "Built a recommendation model using clickstream data, improving targeted promotions 20% reflected in higher conversion rates",
                "Created Tableau dashboards for pre-owned vehicles retail team, reducing reporting time by 40% through automation of data collection and visualization, as measured by comparing pre and post implementation reporting times",
                "Automated the cash reporting process for VP decision making, migrating large portions from Excel to SQL and reducing the overall financial month-end close turnaround time from 3+ days to 1 day"
            ]
        },

        {
            "Tab": " BMW NA",
            "Title": "Software Engineer",
            "Date": "Sept 2022 - Sept 23",
            "Description": [
                "Engineered a vehicle test order management app using TypeScript, Angular, Express, and Node, achieving a 97% validity rate",
                "Architected RESTful APIs, reducing server response time by 30% through optimized query handling and efficient load balancing",
                "Led the design of scalable system architecture for vehicle test order manager, reducing database load and faster data access"
            ]
        },
        
        {
            "Tab": "Sandia Labs",
            "Title": "Research Scientist",
            "Date": "Sept 2021 - Aug 2022",
            "Description": [
                "Conducted microservices penetration testing with Python and TensorFlow, forecasting threats and conducting fraud prevention",
                "Created datasets from attack telemetry, trained Recurrent Neural Networks model, yielding a 90% accuracy in threat detection",
                "Remodeled a load testing tool to conduct DDoS attacks, identifying 7+ vulnerabilities in microservices",
                "Deployed an open source microservices application on Kubernetes using YAML config files, achieving 100% functionality"
            ]
        },
        {
            "Tab": "UoK",
            "Title": "Full Stack Developer",
            "Date": "Mar 2020 - Aug 2021",
            "Description": [
                "Developed and maintained an e-commerce web app using Django, resulting in significant increase in sales within first 6 months",
                "Utilized Python async programming to process real-time user interaction data, improving ad relevance and user engagement",
                "Refactored legacy systems using design patterns and Git, boosting maintainability and reducing technical debt"
            ]
        }
       
    ],
    "FeatureProjects.Title": "Highlighted Projects",
    "FeatureProjects.Label": "Featured Project",
    "FeatureProjects.Projects": [
        {
            "Title": "TOM",
            "Description": "A Next Generation Car Test Order Management System application made from scratch with auth module, <span class='underline'>configurable graphics</span>, <span class='underline'>configurable alarms</span>, and <span class='underline'>user management</span>. It also has feedback form logic for parameter configuration.",
            "imgs": [
                "assets/images/school/Tom1.png",
                "assets/images/school/Tom2.png",
                "assets/images/school/Tom3.png"
            ],
            "Technologies": [
                "Angular",
                "SASS",
                "RxJS",
                "NodeJS",
                "ExpressJS",
                "MySQL"

            ]
        },
        {
            "Title": "Driver Drowsiness Detection",
            "Description": "Revolutionized driver safety technology by analyzing drowsiness detection techniques, specifically focusing on <span class='underline'>facial features </span>. Identified the most effective method with <span class='underline'>95% accuracy</span>",
            "imgs": [
                "assets/images/bbm/val_batch0_labels.jpg",
                "assets/images/bbm/train_batch1.jpg"
            ],
            "demoLink": "https://github.com/Zarak-Shah-ji/Driver-Drowsiness-Detection",
            "Technologies": [
                "Scikit Learn",
                "Matplotlib",
                "YOLO v5",
                "PyTorch",
                "NumPy",
                "OpenCV"
            ]
        },
        {
            "Title": "Crazy Crypto",
            "Description": "Built a real-time updating app for prices, news, and graphs of cryptocurrencies, yielding an informative platform. Install this <span class='underline'> extension </span> to see data in app.",
            "imgs": [
                "assets/images/mazhr/Crazy1.png",
                "assets/images/mazhr/Crazy2.png"
            ],
            "demoLink": "https://ramanand28.github.io/crazyCrypto/",
            "Technologies": [
                "Angular",
                "SASS",
                "Material",
                "Babel",
                "NodeJS"
            ]
        },
        {
            "Title": "Type-2-Heart Research Paper",
            "Description": "Uncovered novel insights into heart failure risk among diabetic patients using the Random Survival Forest machine learning model, unveiling previously undiscovered correlations with 90% accuracy.",
            "imgs": [
                "assets/images/mazhr/heart.jpg"
            ],
            "demoLink": "https://scholarworks.calstate.edu/concern/theses/9593v2206",
            "Technologies": [
                "Survival Analysis",
                "Scikit Learn",
                "Pandas",
                "TensorFlow",
                "Python"
            ]
        }
    ],
    "OtherProjects.Title": "More personal projects",
    "OtherProjects.Projects": [
        {
            "Title": "Recommendation System",
            "Description": "Content-based recommendation system using machine learning for personalized content suggestions",
            "ghLink": "https://github.com/Zarak-Shah-ji/ML/blob/master/Content%20based%20Recommendation%20System",
            "demoLink": "https://github.com/Zarak-Shah-ji/ML/blob/master/Content%20based%20Recommendation%20System",
            "Technologies": [
                "Pandas",
                "NumPy",
                "Jupyter",
                "Python"
            ]
        },
        {
            "Title": "Mac OS Calculator",
            "Description": "A user-friendly mobile/PC interactive iOS calculator",
            "ghLink": "https://comp584-ios-calculator.glitch.me/",
            "demoLink":  "https://comp584-ios-calculator.glitch.me/",
            "Technologies": [
                "React",
                "SASS",
                "Socket.io"
                
            ]
        },
        {
            "Title": "Yander E-commerce",
            "Description": "An elegant E-commerce solution for heritage products.",
            "ghLink": "https://github.com/Zarak-Shah-ji/yander-ecom-3",
            "demoLink": "https://github.com/Zarak-Shah-ji/yander-ecom-3",
            "Technologies": [
                "Python",
                "SASS",
                "Django",
                "API"
            ]
        },
        {
            "Title": "Word Checker",
            "Description": "Searches if a word exists in a specific file or not",
            "ghLink": "https://github.com/Zarak-Shah-ji/Word-Checker",
            "demoLink": "https://github.com/Zarak-Shah-ji/Word-Checker",
            "Technologies": [
                "Trie",
                "C++",
                "Ternary Search Tree"
                
            ]
        },
        {
            "Title": "DeathStar",
            "Description": "Cybersecurity project using Convolutional Neural Networks on application built on microservices",
            "ghLink": "https://github.com/Zarak-Shah-ji/DeathStar",
            "demoLink": "https://github.com/Zarak-Shah-ji/DeathStar",
            "Technologies": [
                "Docker",
                "Kubernetes",
                "YAML",
                "CNN"
                
            ]
        },
        {
            "Title": "Organize",
            "Description": "Explaining file structure of node.js and Express application",
            "ghLink": "https://medium.com/@zarak.shah.ji/deciding-a-file-structure-of-any-application-is-always-a-pain-for-new-developers-b0400a20e86",
            "demoLink": "https://medium.com/@zarak.shah.ji/deciding-a-file-structure-of-any-application-is-always-a-pain-for-new-developers-b0400a20e86",
            "Technologies": [
                "NodeJS",
                "ExpressJS"
                
            ]
        }
    ],
    "Contact.Pretitle": "What’s Next",
    "Contact.Title": "Get in touch!",
    "Contact.Content": "I would be delighted to hear from you if you're interested in discussing new opportunities.",
    "Contact.Btn": "Say Hello"
}
